app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-06-10 16:36:40.747600"], ["email", "email"], ["password", "password"], ["updated_at", "2015-06-10 16:36:40.747600"], ["username", "username"]]
---
	def create
		@user = User.new(user_params)
		#@user = User.new(username: params[:username],
		#	email: params[:email],
		#	password: params[:password])
		if @user.save